In [2]:
import numpy as np
import pandas as pd
data = np.random.standard_normal((10,2))
df = pd.DataFrame(data, columns=['x','y'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     float64
 1   y       10 non-null     float64
dtypes: float64(2)
memory usage: 288.0 bytes

In [3]:
df.head()

          x         y
0  1.189622 -1.690617
1 -1.356399 -1.232435
2 -0.544439 -0.668172
3  0.007315 -0.612939
4  1.299748 -1.733096

In [4]:
df.tail()

          x         y
5 -0.983310  0.357508
6 -1.613579  1.470714
7 -1.188018 -0.549746
8 -0.940046 -0.827932
9  0.108863  0.507810

In [5]:
df['x']>0.5

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: x, dtype: bool

In [6]:
(df['x']>0) & (df['y']<0)

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [7]:
(df['x']>0) | (df['y'] < 0)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [8]:
df[df['x']>0]

          x         y
0  1.189622 -1.690617
3  0.007315 -0.612939
4  1.299748 -1.733096
9  0.108863  0.507810

In [9]:
df.query('x>0')

          x         y
0  1.189622 -1.690617
3  0.007315 -0.612939
4  1.299748 -1.733096
9  0.108863  0.507810

In [10]:
df[(df['x']>0) & (df['y']<0)]

          x         y
0  1.189622 -1.690617
3  0.007315 -0.612939
4  1.299748 -1.733096

In [11]:
df.query('x>0 & y<0')

          x         y
0  1.189622 -1.690617
3  0.007315 -0.612939
4  1.299748 -1.733096

In [14]:
df[(df.x>0) | (df.y<0)]

          x         y
0  1.189622 -1.690617
1 -1.356399 -1.232435
2 -0.544439 -0.668172
3  0.007315 -0.612939
4  1.299748 -1.733096
7 -1.188018 -0.549746
8 -0.940046 -0.827932
9  0.108863  0.507810

In [15]:
df > 0 #comparision dataframes

       x      y
0   True  False
1  False  False
2  False  False
3   True  False
4   True  False
5  False   True
6  False   True
7  False  False
8  False  False
9   True   True

In [16]:
df[df>0]

          x         y
0  1.189622       NaN
1       NaN       NaN
2       NaN       NaN
3  0.007315       NaN
4  1.299748       NaN
5       NaN  0.357508
6       NaN  1.470714
7       NaN       NaN
8       NaN       NaN
9  0.108863  0.507810